app/views/static_pages/home.html.erb

         <%= @gossip[index].title %> -
         <%= @gossip[index].user.first_name %><br/>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]