app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id", "tag_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", nil], ["content", nil], ["created_at", "2022-02-17 12:00:24.569903"], ["updated_at", "2022-02-17 12:00:24.569903"], ["user_id", 11], ["tag_id", nil]]
---
  def create
    @mygossip = gossip_params
    @gossip = Gossip.new(title: @mygossip[:title] , content: @mygossip[:content] , user_id: @mygossip[:user_id])
    if @gossip.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
def edit

@gossip = Gossip.find(params[:id])

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3, "user_id" = $4 WHERE "gossips"."id" = $5  [["title", "feafafeakhu"], ["content", "faehfuakehfkaeuhfkuaehfkuaehfkha"], ["updated_at", "2022-02-17 15:47:55.761591"], ["user_id", 11], ["id", 7]]
---
def update
  @gossip = Gossip.find(params[:id])
  if @gossip.update(gossip_params)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 11]]
---
def destroy

    @gossip = Gossip.find(params[:id])
    @gossip.destroy