app/controllers/static_pages_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @user = User.all
    @gossip = Gossip.all